# ---------
#  11-4
# ---------
# ---------------------------------------------------------- #

require(data.table)

# 建立一般的data.frame
theDF <- data.frame(A=1:10,
                    B=letters[1:10],
                    C=LETTERS[11:20],
                    D=rep(c("One", "Two", "Three"), length.out=10))

# 建立一個data.table
theDT <- data.table(A=1:10,
                    B=letters[1:10],
                    C=LETTERS[11:20],
                    D=rep(c("One", "Two", "Three"), length.out=10))

# 把它們顯示出來,再做比較
theDF
theDT

# 可以注意到data.frame的預設設定會把character資料轉換成factor
# 而data.table不會這麼做
class(theDF$B)
class(theDT$B)

# ---------------------------------------------------------- #

diamondsDT <- data.table(diamonds)
diamondsDT

# ---------------------------------------------------------- #

theDT[1:2, ]
theDT[theDT$A >= 7, ]

# ---------------------------------------------------------- #

theDT[, list(A, C)]

# 只是一個直排
theDT[, B]
# 仍是data.table架構的單一直排
theDT[, list(B)]
B

# ---------------------------------------------------------- #

theDT[, "B", with = FALSE]

theDT[, c("A", "C"), with = FALSE]

theCols <- c("A", "C")
theDT[, theCols, with=FALSE]

# ---------------------------------------------------------- #
# ---------
#  11-4-1
# ---------
# ---------------------------------------------------------- #

# 顯示列表
tables()

# ---------------------------------------------------------- #

# 設定關鍵詞
setkey(theDT, D)

# 再次顯示data.table
theDT

# ---------------------------------------------------------- #

key(theDT)

# ---------------------------------------------------------- #

tables()

# ---------------------------------------------------------- #

theDT["One", ]
theDT[c("One", "Two"), ]

# ---------------------------------------------------------- #

# 設定關鍵詞
setkey(diamondsDT, cut, color)

# ---------------------------------------------------------- #

# 勘查一些橫排
diamondsDT[J("Ideal", "E"), ]
diamondsDT[J("Ideal", c("E", "D")), ]

# ---------------------------------------------------------- #
# ---------
#  11-4-2
# ---------
# ---------------------------------------------------------- #

aggregate(price ~ cut, diamonds, mean)

# ---------------------------------------------------------- #

diamondsDT[, mean(price), by = cut]

# ---------------------------------------------------------- #

diamondsDT[, list(price = mean(price)), by = cut]

# ---------------------------------------------------------- #

diamondsDT[, mean(price), by = list(cut, color)]

# ---------------------------------------------------------- #

diamondsDT[, list(price = mean(price), carat = mean(carat)), by = cut]

# ---------------------------------------------------------- #

diamondsDT[, list(price = mean(price), carat = mean(carat)),
             by = list(cut, color)]

# ---------------------------------------------------------- #